Autodesk.Revit.DB.ExtensibleStorage.Entity.Set``1(System.String,``0,Autodesk.Revit.DB.DisplayUnitType)
Stores the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; this method does not perform data type conversions. The types for containers are
IList for arrays and
IDictionary for maps.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
fieldName:
The name of the field to update.
displayUnits:
The units from which the value will be converted before storing. Must be compatible with the spec
specified when creating the Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name matches no field in this Entity's Schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The displayUnits value is not compatible with the field description.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid floating-point value.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Set``1(Autodesk.Revit.DB.ExtensibleStorage.Field,``0,Autodesk.Revit.DB.DisplayUnitType)
Stores the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; this method does not perform data type conversions. The types for containers are
IList for arrays and
IDictionary for maps.
This method only modifies your copy of the Entity. Store the Entity in an element or
another Entity to save the new value. Write access check is not performed on each call
to Set. Instead, write access is checked when you try to save the Entity in an Element
or another Entity.
field:
The field to update.
displayUnits:
The units from which the value will be converted before storing. Must be compatible with the spec
specified when creating the Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The displayUnits value is not compatible with the field description.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents writing.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid floating-point value.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Get``1(System.String,Autodesk.Revit.DB.DisplayUnitType)
Retrieves the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; this method does not perform data type conversions. The types for containers are
IList for arrays and
IDictionary for maps.
This method is a shortcut that will look up the field by name. If you want to call it
on many entities, it is faster if you look up the field  yourself.
fieldName:
The name of the field to retrieve.
displayUnits:
The units to which the value will be converted before returning. Must be compatible with the spec
specified when creating the Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The name matches no field in this Entity's Schema.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The displayUnits value is not compatible with the field description.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents reading.
Since:
2012
The type of the field

Autodesk.Revit.DB.ExtensibleStorage.Entity.Get``1(Autodesk.Revit.DB.ExtensibleStorage.Field,Autodesk.Revit.DB.DisplayUnitType)
Retrieves the value of the field in the entity.
Remarks:
The template parameter must match the type of the field (specified when creating the
Schema) exactly; this method does not perform data type conversions. The types for containers are
IList for arrays and
IDictionary for maps.
field:
The field to retrieve.
displayUnits:
The units to which the value will be converted before returning. Must be compatible with the spec
specified when creating the Schema.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The Field belongs to a different Schema from this Entity, or this Entity is invalid.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Requested type does not match the field type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The displayUnits value is not compatible with the field description.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This field's subschema prevents reading.
Since:
2012
The type of the field